#!/usr/bin/env python
#-*- coding: UTF-8 -*-
switch = {
    '惠州': {
        '惠州电信-1' : ('-1_traffic_in_522.rrd','Gi0/28',1000),
        '惠州电信-2' : ('-2_traffic_in_647.rrd','Gi0/48',1000,'惠州')
    },
    '顺德': {
        '顺德电信-1' : ('-1_traffic_in_492.rrd','Gi0/24',1000,'顺德')
    },
    '沈阳': {
        '沈阳网通-X1': ('-x1_traffic_in_917.rrd','Gi0/24',1000,'沈阳')
    },
    '济南': {
        '济南网通-1' : ('-1_traffic_in_705.rrd','Gi0/24',500,'济南'),
        '济南网通-3' : ('-2_traffic_in_759.rrd','Gi0/24',500,'济南'),
    },
    '佛山': { 
#        '佛山双线-1' : ('-1_traffic_in_339.rrd','Fa0/24',100,'佛山'),
#        '佛山双线-2' : ('-2_traffic_in_363.rrd','Gi0/23',100,'佛山'),
#        '佛山双线-3' : ('-3_traffic_in_366.rrd','Fa0/1',100,'佛山'),
#        '佛山双线-4' : ('-4_traffic_in_440.rrd','Fa0/2',100,'佛山'),
#        '佛山双线-5' : ('-5_traffic_in_466.rrd','Fa0/1',100,'佛山'),
#        '佛山电信-X1': ('fs1g-x1_traffic_in_87.rrd','Gi0/24',1000,'佛山'),
        '佛山10G-Core':('10g-_traffic_in_1576.rrd','Te1/1',4000,'佛山'),
    },
    '中山': {
        '中山双线-1' : ('-1_traffic_in_1056.rrd','Gi1/0/52',1000,'中山'),
        '中山双线-3' : ('-3_traffic_in_1179.rrd','Gi1/0/28',1000),
        '中山10G-Core':('10g-121_201_102_1_traffic_in_2242.rrd','Te1/1',3000),
    },
    '深圳': {
        '深圳BGP'    : ('bgp_220_231_248_66_traffic_in_1514.rrd','Gi1/0/24',100,),
    },
    '肇庆': {
        '肇庆双线-1' : ('-1_traffic_in_1458.rrd','Gi1/0/24',100)
    },
    '常州':{
        '常州' : ('-110_100_64_3_traffic_in_2327.rrd','Te0/1',3000)
    },
    '香港': {
        '香港' :('-1_traffic_in_1571.rrd','Gi1/0/24',100)
    },
}

