#!/usr/bin/env python
# -*- coding: UTF-8 -*-
dict_switch = {
    '惠州': {
        '惠州电信1-1G': ('-1_traffic_in_522.rrd', 'Gi0/28', 1000, '519'),
        '惠州电信2-1G': ('-2_traffic_in_647.rrd', 'Gi0/48', 1000, '644')
    },
    '顺德': {
        '顺德电信-1G': ('-1_traffic_in_492.rrd', 'Gi0/24', 1000, '489')
    },
    '沈阳': {
        '沈阳联通-1G': ('-x1_traffic_in_917.rrd', 'Gi0/24', 1000, '914')
    },
    '济南': {
        '济南联通1-0.25G': ('-1_traffic_in_705.rrd', 'Gi0/24', 250, '702'),
        '济南联通2-0.75G': ('-2_traffic_in_759.rrd', 'Gi0/24', 750, '756'),
    },
    '佛山': {
        #        '佛山双线-1' : ('-1_traffic_in_339.rrd','Fa0/24',100,'佛山'),
        #        '佛山双线-2' : ('-2_traffic_in_363.rrd','Gi0/23',100,'佛山'),
        #        '佛山双线-3' : ('-3_traffic_in_366.rrd','Fa0/1',100,'佛山'),
        #        '佛山双线-4' : ('-4_traffic_in_440.rrd','Fa0/2',100,'佛山'),
        #        '佛山双线-5' : ('-5_traffic_in_466.rrd','Fa0/1',100,'佛山'),
        #        '佛山电信-X1': ('fs1g-x1_traffic_in_87.rrd','Gi0/24',1000,'佛山'),
        '佛山电信-5G': ('10g-_traffic_in_1576.rrd', 'Te1/1', 5000, '1585'),
        '佛山联通-50M': ('10g-_traffic_in_1578.rrd', 'Te1/3', 50, '1587'),
    },
    '中山': {
        #        '中山双线1-1G' : ('-1_traffic_in_1056.rrd','Gi1/0/52',1000,'中山'),
        #        '中山双线2-1G' : ('-3_traffic_in_1179.rrd','Gi1/0/28',1000),
        '中山电信-3.5G': ('10g-121_201_102_1_traffic_in_2242.rrd', 'Te1/1', 3500, '2251'),
        '中山联通-0.5G': ('10g-121_201_102_1_traffic_in_2244.rrd', 'Te1/3', 500, '2253'),
    },
    #    '深圳': {
    #        '深圳BGP'    : ('bgp_220_231_248_66_traffic_in_1514.rrd','Gi1/0/24',100,),
    #    },
    #    '肇庆': {
    #        '肇庆双线-1' : ('-1_traffic_in_1458.rrd','Gi1/0/24',100)
    #    },
    '常州': {
        '常州电信-3G': ('10g-112_73_64_1_traffic_in_2412.rrd', 'Te1/32', 3000, '2421'),
        '常州联通-100M': ('10g-112_73_64_1_traffic_in_2410.rrd', 'Te1/30', 100, '2419'),
    },
    '香港': {
        '香港-50M': ('-1_traffic_in_1571.rrd', 'Gi1/0/24', 50, '1580')
    },
    '南方基地': {
        '南方基地-0.5G': ('-1172_16_9_2_traffic_in_5560.rrd', 'GigabitEthernet1/0/25', 500, '5561')
    },
    '成都': {
        '成都电信-1G': ('-222_211_64_194_traffic_in_5693.rrd', 'GigabitEthernet1/0/1', 1000, '5694')
    },
    '武汉': {
        '武汉电信-1G': ('-116_211_88_2_traffic_in_5747.rrd', 'GigabitEthernet1/0/23', 1000, '5748'),
        '武汉联通-100M': ('-116_211_88_2_traffic_in_5746.rrd', 'GigabitEthernet1/0/22', 100, '5747'),
    }
    #    '光纤出口':{
    #        '电信50M':('10_10_10_1_traffic_in_5687.rrd','eth2',50),
    #        '睿江100M':('10_10_10_1_traffic_in_5688.rrd','eth3',100),
    #        '电信100M':('10_10_10_2_traffic_in_5690.rrd','eth1',100),
    #        '睿江国际10M':('10_10_10_2_traffic_in_5691.rrd','eth2',10),
    #        '联通10M':('10_10_10_2_traffic_in_5692.rrd','eth3',10)
    #    }
}
